#pragma once
#include <opencv2/opencv.hpp>
#include <opencv2/highgui/highgui.hpp>
using namespace cv;

#include <iostream>
#pragma once
#include <conio.h>
#include <Windows.h>
#include <time.h>
#include <fstream>
using namespace std;

/**===========================================Media 클래스================================================================================
*	@author 조영제
*	@date 2014/12/04
*	@brief Media 클래스( 상품 사진출력,CCTV를 담당하는 클라스 ) -  opencv 사용
*	@details 마켓의 보안을 높이기 위한 CCTV 기능과 상품사진출력을 담당하는 함수가 있는 클라스이다.
*===============================================================================================================================================*/

class Media 
{
private :
	int count;
	Media *P_DB[20]; //사진정보가 있는 상품 리스트
	string P_name; // 상품의 이름
public:
	/**=========================================================================================================================
	* @brief Media의 생성자
	*=========================================================================================================================*/
	Media(){count=0;};
	/**=========================================================================================================================
	* @brief Media의 소멸자
	*=========================================================================================================================*/
	~Media(){};

	/**===========================================================================================================
	*	사진이 있는 상품 DB를 불러와서 배열에 저장하는 함수이다
	*	@brief	배열 안에 사진이 있는 상품 DB에 있는 내용을 넣게 된다.
	*	@pre	사진이 있는 상품 DB가 존재해야된다,
	*	@post	사진이 있는 상품 DB가 목록에 들어가게된다.
	=============================================================================================================*/
	void load_pro_name();

	/**===========================================================================================================
	*	사진이 있는 상품의 이름을 설정하는 함수이다.
	*	@brief	P_name을 재설정 해주는 함수이다.
	*	@pre	없다,
	*	@post	P_name이 새로운 값으로 설정 되게 된다.
	=============================================================================================================*/
	void set_P_name(string _p_name){P_name=_p_name;};
	/**===========================================================================================================
	*	P_name를 리턴하는 함수이다
	*	@brief	P_name을 리턴한다.
	*	@pre	MusP_nameic_Num의 정보가 들어가 있어야 한다.
	*	@post	P_name을 리턴한다.
	=============================================================================================================*/
	string get_P_name(){return P_name;}

	/**===========================================================================================================
	*	검색한 상품의 이미지 정보를 출력하는 함수이다.
	*	@brief	검색한 상품의 이미지 정보를 출력하는 함수이다.
	*	@pre	사진이 있는 상품DB에 들어가 있어야 된다.
	*	@post	검색한 상품의 이미지가 뜨게된다.
	=============================================================================================================*/
	void print_Picture(string name);

	/**===========================================================================================================
	*	CCTV의 기능을 구현하게 하는 함수이다.
	*	@brief	cctv화면을 띄우고 저장을 하게 된다.
	*	@pre	코덱정보를 설정해야한다.
	*	@post	CCTV화면이 뜨고 요일에따라 자동저장 되게 된다..
	=============================================================================================================*/
	void On_Capture();
};






